demo-errorhandling/src/main/resources/data/soap-order1.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Header />
	<soap:Body>
		<sendOrder xmlns="http://ws.demo.fuse.jboss.com/">
			<order xmlns="http://demo.fuse.jboss.com/order">
				<customer id="C0003">
					<name>Columbus Zoo and Aquarium</name>
					<city>Columbus</city>
					<country>US</country>
				</customer>
				<date>2012-03-03</date>
				<orderlines>
					<orderline>
						<article id="C0003">
							<description>Camel</description>
						</article>
						<quantity>100</quantity>
					</orderline>
					<orderline>
						<article id="C0333">
							<description>Crocodile</description>
						</article>
						<quantity>1</quantity>
					</orderline>
				</orderlines>
			</order>
		</sendOrder>
	</soap:Body>
</soap:Envelope>
